In [15]:
#Lab1: Suppose you are a teacher, and you want to analyze the exam scores of your students in a particular subject.
#You have recorded the scores of your students for a recent exam, and you want to represent this data using a Pandas Series.


import pandas as pd

students = ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack']
exam_scores = [92, 88, 76, 94, 82, 90, 85, 89, 78, 91]
scores_series = pd.Series(exam_scores, index=students)
print(f'Name: Exam Scores')
scores_series

Name: Exam Scores

Alice      92
Bob        88
Charlie    76
David      94
Eve        82
Frank      90
Grace      85
Hannah     89
Ivy        78
Jack       91
dtype: int64

In [16]:
#Lab2: Suppose you want to track and analyze your household expenses for a month. You have recorded the expenses for various 
#categories, such as groceries, utilities, rent, transportation, and entertainment. You can represent this expense data using a Pandas Series.

# Expense categories
categories = ['Groceries', 'Utilities', 'Rent', 'Transportation', 'Entertainment']
# Monthly expense data (example data in USD)
expenses = [500, 200, 1200, 300, 150]
expenses_series = pd.Series(expenses, index=categories)
print(f'Name:    Monthly Expenses(USD)')
expenses_series

Name:    Monthly Expenses(USD)

Groceries          500
Utilities          200
Rent              1200
Transportation     300
Entertainment      150
dtype: int64

In [18]:
#Lab3: Suppose you want to track and analyze the monthly energy consumption in your home. You have recorded the monthly energy usage for 
#electricity and gas over a year, and you want to represent this data using Pandas Series.

# Months in a year
months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']
# Monthly energy consumption data (example data in kilowatt-hours for electricity and therms for gas)
electricity_usage = [350, 320, 310, 330, 340, 370, 380, 360, 350, 330, 320, 330]
gas_usage = [20, 18, 16, 15, 12, 10, 8, 9, 12, 15, 17, 19]

electricity_series = pd.Series(electricity_usage, index=months)
gas_series = pd.Series(gas_usage, index=months)
print("Electricity Usage (kWh):")
print(electricity_series)
print("\nGas Usage (therms):")
gas_series

Electricity Usage (kWh):
January      350
February     320
March        310
April        330
May          340
June         370
July         380
August       360
September    350
October      330
November     320
December     330
dtype: int64

Gas Usage (therms):

January      20
February     18
March        16
April        15
May          12
June         10
July          8
August        9
September    12
October      15
November     17
December     19
dtype: int64

In [17]:
#Lab4:Suppose you are managing a website and want to analyze the monthly revenue generated from advertising. You have recorded
#the monthly revenue for the past year, and you want to represent this data using a Pandas Series.

# Months in a year
months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']
# Monthly advertising revenue data (example data in USD)
revenue = [5000, 5200, 4800, 5400, 5600, 5800, 6100, 5900, 6200, 6500, 7000, 6900]
revenue_series = pd.Series(revenue, index=months)
print(f'Name:    Monthly Adverstising Revenue(USD)')
revenue_series

Name:    Monthly Adverstising Revenue(USD)

January      5000
February     5200
March        4800
April        5400
May          5600
June         5800
July         6100
August       5900
September    6200
October      6500
November     7000
December     6900
dtype: int64

In [ ]:
#Second Lab Work

In [5]:
#Lab1: Write a Pandas program to create a dataframe from a dictionary and display it.

score={'Math':[78,85,96,80,86], 'English':[84,94,89,83,86],'Hindi':[86,97,96,72,83]}
df = pd.DataFrame(score)
df

   Math  English  Hindi
0    78       84     86
1    85       94     97
2    96       89     96
3    80       83     72
4    86       86     83

In [11]:
#Lab2: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
import numpy as np

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [12]:
#Lab3: Write a Pandas program to get the first 3 rows of a given DataFrame.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)
first_3_rows = df.head(3)
first_3_rows

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

In [14]:
#Lab4: Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)
name_and_score = df[['name', 'score']]
print("Original Data:")
print(df)
print("Select Specific Column: ")
name_and_score

Original Data:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
Select Specific Column:

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0